jjdb210/Diz_BLE/ESP32_C3_BLE_Dress100/ESP32_C3_BLE_Dress100.h
/* 
  Justins DRESS V3.01 Code - https://emcot.world/The_Disney_Dress
  Designed for an ESP32c3 NO SD CARD
  Author: Justin Gehring
  http://emcot.world/
  
  Based on Neil Kolban example for IDF: https://github.com/nkolban/esp32-snippets/blob/master/cpp_utils/tests/BLE%20Tests/SampleScan.cpp
  Ported to Arduino ESP32 by Evandro Copercini
*/

#include <Arduino.h>
#include "NimBLEDevice.h"
#include <NimBLEAdvertisedDevice.h>
#include "NimBLEBeacon.h"
#include <Adafruit_NeoPixel.h>
#define ENDIAN_CHANGE_U16(x) ((((x)&0xFF00) >> 8) + (((x)&0xFF) << 8))
#include <ESP32Time.h>
#define BYTE_TO_BINARY_PATTERN "%c%c%c%c%c%c%c%c "
#define BYTE_TO_BINARY(byte) \
  (byte & 0x80 ? '1' : '0'), \
    (byte & 0x40 ? '1' : '0'), \
    (byte & 0x20 ? '1' : '0'), \
    (byte & 0x10 ? '1' : '0'), \
    (byte & 0x08 ? '1' : '0'), \
    (byte & 0x04 ? '1' : '0'), \
    (byte & 0x02 ? '1' : '0'), \
    (byte & 0x01 ? '1' : '0')
	
// What pin are the LEDs on the dress (D10 is NOT the same as 10). and how many are there?
//dress!! #define PIN D10
#define N_LEDS 110
#define DRESS_ID 1  //Each dress needs an ID (1-5) (Links specific wands. Not currently in use)

//Initiliaze the dress strip.
Adafruit_NeoPixel strip = Adafruit_NeoPixel(N_LEDS, PIN, NEO_BGR + NEO_KHZ800);

int scanTime = 1;  //In seconds
int sequenceNumber = 0;
int mode = 0;  
int dressmode = 0; //Default to Kid mode (details at: https://emcot.world/index.php/Disney_Bluetooth_Wands)
bool blackout = false;

int lastmode = 0;
int timer = 0;

BLEScan *pBLEScan; //Old code but compatible
ESP32Time rtc(3600);

int selected_color = 1;
int last_color = 0;
int last_sequence = 0;
uint32_t temp_color_array[] = { strip.Color(0, 0, 0), strip.Color(0, 0, 0), strip.Color(0, 0, 0), strip.Color(0, 0, 0), strip.Color(0, 0, 0) };

int temp_start = 0;
int temp_x = 0;
int temp_y = 0;
int temp_z = 0;


hw_timer_t *My_timer = NULL;


//https://emcot.world/Disney_MagicBand%2B_Bluetooth_Codes
uint32_t pallet_array[] = { 
  strip.Color(0, 255, 255),      //0 = Cyan
  strip.Color(30, 255, 255),     //1 = Purple
  strip.Color(0, 0, 255),        //2 = Blue
  strip.Color(0, 0, 128),        //3 = Midnight Blue
  strip.Color(0, 0, 255),        //4 = Blue 
  strip.Color(255, 60, 255),     //5 = bright purple
  strip.Color(153, 0, 153),      //6 = lavender
  strip.Color(153, 0, 153),      //7 = purple
  strip.Color(195, 122, 123),      //8 = pink
  strip.Color(195, 122, 123),     //9 = pink
  strip.Color(195, 122, 123),      //10 = pink
  strip.Color(195, 122, 123),      //11 = pink
  strip.Color(195, 122, 123),      //12 = pink
  strip.Color(195, 122, 123),      //13 = pink
  strip.Color(195, 122, 123),      //14 = pink
  strip.Color(255, 60, 0),       //15 = Yellow Orange
  strip.Color(255, 255, 128),    //16 Off Yellow
  strip.Color(255, 200, 50),     //17 Yellow ORange
  strip.Color(51, 255, 51), 	 //18 Lime Greenstrip.Color(51, 255, 51), 
  strip.Color(255, 50, 0),       //19 Orange
  strip.Color(255, 30, 0),       //20 Red Orange?
  strip.Color(255, 0, 0),        //21 Red 
  strip.Color(0, 255, 255),		 //22 cyan
  strip.Color(0, 255, 255),		  //23 cyan
  strip.Color(0, 255, 255),		//24 cyan
  strip.Color(0, 255, 0),         //25 Green
  strip.Color(0, 255, 51),  		//26 Lime Green
  strip.Color(255, 255, 255),		//27 White
  strip.Color(255, 255, 255),		//28 white
  strip.Color(0, 0, 0),				//29 Off
  strip.Color(0, 0, 0),				//unique
  strip.Color(255, 255, 255)      //Random                   
};

// This is used by the bluetooth wand.
// More colors can be added.
uint32_t mode_array[] = {
  strip.Color(0,0,255),
  strip.Color(0,255,0),
  strip.Color(0,255,255),
  strip.Color(255,255,0),
  strip.Color(255,0,255),
  strip.Color(255,255,255),
  strip.Color(255, 0, 0),     
  strip.Color(50, 50, 50),                              
  strip.Color(255, 99, 33),    
  strip.Color(255, 102, 0)
};  




//This is the Bluetooth scanner... Listening for all the fun stuff.
class MyAdvertisedDeviceCallbacks : public BLEAdvertisedDeviceCallbacks {
  
	// Solid Pallette Colors
	void e905_function(uint8_t param1, uint8_t param2, uint8_t param3){
		int color = param3 & 0x1f;
		mode = 2;
		Serial.printf("E905: %i", color);
		Serial.printf("\n");
		for (int i = 0; i < N_LEDS; i++) {
			strip.setPixelColor(i, pallet_array[color]);
		}
		
		strip.show();
		delay(3000);
	}

	void e906_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5){
		mode = 2;
		int color1 = param4 & 0x1f;
		int color2 = param5 & 0x1f;
		int color3 = param3 & 0x1f;
		int color4 = param2 & 0x1f;
		Serial.printf("e908: %i %i %i %i", color1, color2, color3, color4);
		for (int i = 0; i < N_LEDS; i++) {
		  if (i % 2 == 0){
			strip.setPixelColor(i, pallet_array[color1]);
		  } else {
			strip.setPixelColor(i, pallet_array[color2]);
		  }
		}
		strip.show();
		delay(3000);
	}

	//Single 6bit color
	void e908_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5){
		int r1 = (param3 >> 2) * 4;
		int g1 = (param4 >> 2) * 4;
		int b1 = (param5 >> 2) * 4;
		int time = param2 * 60;

		mode = 2;
		for (int i = 0; i < N_LEDS; i++) {
			strip.setPixelColor(i, strip.Color(r1, g1, b1));
		}
		strip.show();
		Serial.printf("E908: %i %i %i Time: %i", r1,g1,b1,time);
		delay(time);

	}

	//5 Color Pallet
	void e909_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5, uint8_t param6,uint8_t param7){
	  //8301e100e90900050fa7b1a7b1a7b0
	  //8301e100e909000f0fafa4b9a4b9b0
	  int color[5];
	  color[2] = param3 & 0x1f;  //Middle
	  color[1] = param4 & 0x1f;  //Top Right
	  color[3]= param5 & 0x1f;  //Bottom Right
	  color[4] = param6 & 0x1f;  //Bottom Left
	  color[0] = param7 & 0x1f;  //Top Left
	 mode = 2;
	 Serial.printf("Found Color: %i %i %i %i %i", color[0],color[1],color[2],color[3],color[4]);
	 for (int j = 0; j <= 4; j++){
	 for (int i = ((N_LEDS / 5) * j); i < ((N_LEDS / 5) * j) + (N_LEDS / 5); i++){
		//strip.setPixelColor(i, pallet_array[color[i % 5]]);
		strip.setPixelColor(i, pallet_array[color[j]]);
	 }
	 }
	  strip.show();
	  delay(3000);
	}
	
