jjdb210/Diz_BLE/ESP32_C3_BLE_Dress100/ESP32_C3_BLE_Dress100.h
	void e90a_function(){
		//unknown
	}
	
	void e90b_function(){
		//documented but not coded.
	}
	//
	void e90c_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5, uint8_t param6,uint8_t param7,uint8_t param8){
		  //LOTS TO DECODE HERE NOT SURE WHAT ALL THIS DOES
		  //e100e90c 000f0f b1b9b5b1a2307b7db0
		  //e100e90c 000f0f 5d465bf00532374895
		  //Not Working: e100e90c000f0f5d465bf00532374895  Blink
		  //83 01 e1 00 e9 0c 00 0f0f b2b2b2b2b2 -307b7db0
		  int color[5];
		color[2] = param3 & 0x1f;  //Middle
		color[1] = param4 & 0x1f;  //Top Right
		color[3] = param5 & 0x1f;  //Bottom Right
		color[4] = param6 & 0x1f;  //Bottom Left
		color[0] = param7 & 0x1f;  //Top Left

		mode = 2;
		Serial.printf("Found E90C Color: %i %i %i %i %i", color[0],color[1],color[2],color[3],color[4]);
		Serial.printf("\n");
		int randomon = 0;
		for (int k = 0; k < 40; k++){
		  for (int j = 0; j <= 4; j++){
			for (int i = ((N_LEDS / 5) * j); i < ((N_LEDS / 5) * j) + (N_LEDS / 5); i++){
			   //strip.setPixelColor(i, pallet_array[color[i % 5]]);
				strip.setPixelColor(i, pallet_array[color[(j + k) % 5]]);
			}
		  }
		  
		  strip.show();
		  delay(400);
		}
		for (int i = 0; i < N_LEDS; i++) {
		  strip.setPixelColor(i, pallet_array[30]);
		}
		strip.show();
	}

	void e90d_function(){
	}
	
	void e90e_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5, uint8_t param6,uint8_t param7,uint8_t param8,uint8_t param9,uint8_t param10,uint8_t param11,uint8_t param12){
		//8301e100e90e00 130f b9b5b5b1b3 590ffb 48ae b0
		//8301e100e90e00 110f a3a3a3a3a3 591902 48ae b0
		//e100e90e00 e1d2 550027fcd258005f2878b0
		//e100e90e00 11d2 55fc4bfcd25800fc0078b0 

		//8301e100e90e0011d255fc4bfcd25800fc0068b0
		//                                    ^
		mode = 2;
		int color[5];
		//e90e has 2 sub functions it seems, but we're not sure why. Not sure if param2 or param12 is the magic (or something else) 2 works for now.
		if (param2 == 0xd2){
			//2 6-bit hex colors
			//first color middle
			//second color outline
			// e100e90e00 23 d255 fc00fc d258 fc3900 78b0      //orange outline purple center
			int r1 = (param4 >> 2) * 4;
			int g1 = (param5 >> 2) * 4;
			int b1 = (param6 >> 2) * 4;
			
			int r2 = (param9 >> 2) * 4;
			int g2 = (param10 >> 2) * 4;
			int b2 = (param11 >> 2) * 4;
			int time = param2 * 60;
		  for (int i = 0; i < N_LEDS; i++) {
			if (i % 5 == 0){
			  strip.setPixelColor(i, strip.Color(r1, g1, b1));
			} else {
			  strip.setPixelColor(i, strip.Color(r2, g2, b2));
			}
		  }
		  strip.show();
		  Serial.printf("Color: %i %i %i %i %i %i Time: %i", r1,g1,b1,r2,g2,b2,time);
		  delay(time);

		} else if (param2 == 0x0f) {
		  
		  color[2] = param3 & 0x1f;  //Middle
		  color[1] = param4 & 0x1f;  //Top Right
		  color[3]= param5 & 0x1f;  //Bottom Right
		  color[4] = param6 & 0x1f;  //Bottom Left
		  color[0] = param7 & 0x1f;  //Top Left
		  mode = 2;
		  Serial.printf("Found Color: %i %i %i %i %i", color[0],color[1],color[2],color[3],color[4]);
		  Serial.printf("\n");
		  int randomon = 0;
		  for (int k = 0; k < 20; k++){
			for (int j = 0; j <= 4; j++){
			  randomon = random(0,3);
				for (int i = ((N_LEDS / 5) * j); i < ((N_LEDS / 5) * j) + (N_LEDS / 5); i++){
				//strip.setPixelColor(i, pallet_array[color[i % 5]]);
				  if (randomon == 0){
				  strip.setPixelColor(i, pallet_array[color[j]]);
				  } else {
					strip.setPixelColor(i, pallet_array[30]);
				  }
				}
			}
			strip.show();
			delay(200);
		  
		  }
		}
		  for (int i = 0; i < N_LEDS; i++) {
			strip.setPixelColor(i, pallet_array[30]);
		  }
		  strip.show();
	}

	void e90f_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5, uint8_t param6,uint8_t param7,uint8_t param8,uint8_t param9,uint8_t param10,uint8_t param11,uint8_t param12){
	  mode = 2;
	  int color[5];
	  color[0] = param3 & 0x1f;
	  color[1] = param4 & 0x1f;
	  Serial.printf("Found E90f Color: %i %i", color[0], color[1]);
	  for (int j=0; j<30; j++){
		for (int i = 1; i < N_LEDS; i++){
		  if (i % 2 == 0){
			strip.setPixelColor(i, pallet_array[color[0]]);
		  } else {
			strip.setPixelColor(i, pallet_array[30]);
		  }
		}
		strip.show();
		delay(100);
		for (int i = 1; i < N_LEDS; i++){
		  if (i % 2 == 0){
			strip.setPixelColor(i, pallet_array[30]);
		  } else {
			strip.setPixelColor(i, pallet_array[color[0]]);
		  }
		}
		strip.show();
		delay(100);
	  }     
	}

	void e910_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5, uint8_t param6,uint8_t param7,uint8_t param8,uint8_t param9,uint8_t param10,uint8_t param11,uint8_t param12){
	  mode = 2;
	  int color[5];
	  color[0] = param3 & 0x1f;
	  color[1] = param4 & 0x1f;
	  Serial.printf("Found E910 Color: %i %i", color[0], color[1]);
	  for (int j=0; j<5; j++){
		for (int i = 1; i < N_LEDS; i++){
		  if (i % 2 == 0){
			strip.setPixelColor(i, pallet_array[color[0]]);
		  } else {
			strip.setPixelColor(i, pallet_array[color[1]]);
		  }
		}
		strip.show();
		delay(1000);
		for (int i = 1; i < N_LEDS; i++){
		  if (i % 5 == 0){
			strip.setPixelColor(i, pallet_array[30]);
		  } else {
			strip.setPixelColor(i, pallet_array[30]);
		  }
		}
		strip.show();
		delay(300);
	  }     
	}

	void e911_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5, uint8_t param6,uint8_t param7,uint8_t param8,uint8_t param9,uint8_t param10,uint8_t param11,uint8_t param12){
	  mode = 2;
	  //2 colors
	  int color[5];
	  color[0] = param3 & 0x1f;
	  color[1] = param4 & 0x1f;
	  Serial.printf("Found E91 Color: %i %i", color[0], color[1]);

	  int red1 = pallet_array[color[0]] >> 16 & 0xff;
	  int green1 = pallet_array[color[0]] >> 8 & 0xff;
	  int blue1 = pallet_array[color[0]] >> 0 & 0xff;
	  int red2 = pallet_array[color[1]] >> 16 & 0xff;
	  int green2 = pallet_array[color[1]] >> 8 & 0xff;
	  int blue2 = pallet_array[color[1]] >> 0 & 0xff;

	  int red_step = (red2 - red1) / 30;
	  int green_step = (green2 - green1) / 30;
	  int blue_step = (blue2 - blue1) / 30;
	  for (int temp_y = 0; temp_y < 4; temp_y++){
		for (int temp_x = 0; temp_x < 30; temp_x++){
		  uint32_t current_color = strip.Color(red1 + (temp_x * red_step), green1 + (temp_x * green_step), blue1 + (temp_x * blue_step));
		  uint32_t current_color2 = strip.Color(red2 - (temp_x * red_step), green2 - (temp_x * green_step), blue2 - (temp_x * blue_step));
		
		  for (int i = 1; i < N_LEDS; i++){
			if (i % 2 == 0){
			  strip.setPixelColor(i, current_color);
			} else {
			  strip.setPixelColor(i, current_color2);
			}
		  }
		  
		  strip.show();
		  delay(20);
		}
		for (int temp_x = 30; temp_x > 0; temp_x--){
		  uint32_t current_color = strip.Color(red1 + (temp_x * red_step), green1 + (temp_x * green_step), blue1 + (temp_x * blue_step));
		  uint32_t current_color2 = strip.Color(red2 - (temp_x * red_step), green2 - (temp_x * green_step), blue2 - (temp_x * blue_step));
		
		  for (int i = 1; i < N_LEDS; i++){
			if (i % 2 == 0){
			  strip.setPixelColor(i, current_color);
			} else {
			  strip.setPixelColor(i, current_color2);
			}
		  }
		  strip.show();
		  delay(20);
		}
	  }
	}

	void e912_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5, uint8_t param6,uint8_t param7,uint8_t param8,uint8_t param9,uint8_t param10,uint8_t param11,uint8_t param12){
	  mode = 2;
	  //2 colors
	  int color[5];
	  color[0] = param3 & 0x1f;
	  color[1] = param4 & 0x1f;
	  Serial.printf("Found E91 Color: %i %i", color[0], color[1]);

	  int red1 = pallet_array[color[0]] >> 16 & 0xff;
	  int green1 = pallet_array[color[0]] >> 8 & 0xff;
	  int blue1 = pallet_array[color[0]] >> 0 & 0xff;
	  int red2 = pallet_array[color[1]] >> 16 & 0xff;
	  int green2 = pallet_array[color[1]] >> 8 & 0xff;
	  int blue2 = pallet_array[color[1]] >> 0 & 0xff;

	  int red_step = (red2 - red1) / 30;
	  int green_step = (green2 - green1) / 30;
	  int blue_step = (blue2 - blue1) / 30;
	  for (int temp_y = 0; temp_y < 4; temp_y++){
		for (int temp_x = 0; temp_x < 30; temp_x++){
		  uint32_t current_color = strip.Color(red1 + (temp_x * red_step), green1 + (temp_x * green_step), blue1 + (temp_x * blue_step));
		  uint32_t current_color2 = strip.Color(red2 - (temp_x * red_step), green2 - (temp_x * green_step), blue2 - (temp_x * blue_step));
		
		  for (int i = 1; i < N_LEDS; i++){
			if (i % 2 == 0){
			  strip.setPixelColor(i, current_color);
			} else {
			  strip.setPixelColor(i, current_color2);
			}
		  }
		  
		  strip.show();
		  delay(20);
		}
		for (int temp_x = 30; temp_x > 0; temp_x--){
		  uint32_t current_color = strip.Color(red1 + (temp_x * red_step), green1 + (temp_x * green_step), blue1 + (temp_x * blue_step));
		  uint32_t current_color2 = strip.Color(red2 - (temp_x * red_step), green2 - (temp_x * green_step), blue2 - (temp_x * blue_step));
		
		  for (int i = 1; i < N_LEDS; i++){
			if (i % 2 == 0){
			  strip.setPixelColor(i, current_color);
			} else {
			  strip.setPixelColor(i, current_color2);
			}
		  }
		  strip.show();
		  delay(20);
		}
	  }
	}

	void e914_function(uint8_t param1, uint8_t param2, uint8_t param3,uint8_t param4, uint8_t param5, uint8_t param6,uint8_t param7,uint8_t param8,uint8_t param9,uint8_t param10,uint8_t param11,uint8_t param12){
	  mode = 2;
	  int color[5];
	  color[0] = param3 & 0x1f;
	  color[1] = param4 & 0x1f;
	  Serial.printf("Found E914 Color: %i %i", color[0], color[1]);

	  int red1 = pallet_array[color[0]] >> 16 & 0xff;
	  int green1 = pallet_array[color[0]] >> 8 & 0xff;
	  int blue1 = pallet_array[color[0]] >> 0 & 0xff;
	  int red2 = pallet_array[color[1]] >> 16 & 0xff;
	  int green2 = pallet_array[color[1]] >> 8 & 0xff;
	  int blue2 = pallet_array[color[1]] >> 0 & 0xff;

	  int red_step = (red2 - red1) / 30;
	  int green_step = (green2 - green1) / 30;
	  int blue_step = (blue2 - blue1) / 30;
	  for (int temp_y = 0; temp_y < 4; temp_y++){
		for (int temp_x = 0; temp_x < 30; temp_x++){
		  uint32_t current_color = strip.Color(red1 + (temp_x * red_step), green1 + (temp_x * green_step), blue1 + (temp_x * blue_step));
		  uint32_t current_color2 = strip.Color(red2 - (temp_x * red_step), green2 - (temp_x * green_step), blue2 - (temp_x * blue_step));
		
		  for (int i = 1; i < N_LEDS; i++){
			if (i % 2 == 0){
			  strip.setPixelColor(i, current_color);
			} else {
			  strip.setPixelColor(i, current_color2);
			}
		  }
		  strip.show();
		  delay(20);
		}
		for (int temp_x = 30; temp_x > 0; temp_x--){
		  uint32_t current_color = strip.Color(red1 + (temp_x * red_step), green1 + (temp_x * green_step), blue1 + (temp_x * blue_step));
		  uint32_t current_color2 = strip.Color(red2 - (temp_x * red_step), green2 - (temp_x * green_step), blue2 - (temp_x * blue_step));
		
		  for (int i = 1; i < N_LEDS; i++){
			if (i % 2 == 0){
			  strip.setPixelColor(i, current_color);
			} else {
			  strip.setPixelColor(i, current_color2);
			}
		  }

		  strip.show();
		  delay(20);
		}
	  }
	}





  void onResult(BLEAdvertisedDevice *advertisedDevice) {

