jjdb210/Diz_BLE/ESP32_C3_BLE_Dress100/ESP32_C3_BLE_Dress100.h
    //Anything that doesn't have this, we should just ignore.
    if (advertisedDevice->haveManufacturerData() == true) {
      std::string strManufacturerData = advertisedDevice->getManufacturerData();
      uint8_t cManufacturerData[100];
      strManufacturerData.copy((char *)cManufacturerData, strManufacturerData.length(), 0);


      //Is this Justins Wand?
      if (cManufacturerData[0] == 0x42 && cManufacturerData[1] == 0x01) {
        sequenceNumber++;

        //Debug Data Can be commented out.
        Serial.printf("Found JJWand: ", strManufacturerData.length());
        Serial.printf("A %i %s ", sequenceNumber, advertisedDevice->getAddress().toString().c_str());
        for (int i = 2; i < strManufacturerData.length(); i++) {
          Serial.printf("%02x", cManufacturerData[i]);
        }

        
        if (strManufacturerData.length() > 4) {
          if (cManufacturerData[2] == 0) {
            if (cManufacturerData[3] == 5) {
              blackout = true;
              dressmode = 1;   
              
            } else if (cManufacturerData[3] == 6) {
              blackout = false;
              dressmode = 0;   
              mode = 0;
            } else if (cManufacturerData[3] == 0) {     //Solid Colors
              mode = 0;
              selected_color = cManufacturerData[4];
              Serial.printf("Selected Color Is: %i", selected_color);
            } else if (cManufacturerData[3] == 1) {     //Patterns
              mode = 0;
              selected_color = cManufacturerData[4];
              
              //mode = cManufacturerData[3];
              //selected_color = cManufacturerData[4];      
              //Serial.printf("Selected Pattern Is: %i", selected_color);                          
            } else if (cManufacturerData[3] == 3) {     //Unlock
              mode = 0;
              dressmode = 0;                 
            } 
          }
        } else {
          Serial.printf("Invalid Code Detected");
        }

        Serial.printf("\n");




        
      } else if (cManufacturerData[0] == 0x83 && cManufacturerData[1] == 0x01 && cManufacturerData[4] == 0xe9) {
        //Is this Disney?Disney Code 
        sequenceNumber++;
        Serial.printf("Found Disney: ", strManufacturerData.length());
        Serial.printf("A %i %s ", sequenceNumber, advertisedDevice->getAddress().toString().c_str());
        for (int i = 2; i < strManufacturerData.length(); i++) {
          Serial.printf("%02x", cManufacturerData[i]);
        }
        Serial.printf("\n");
        //e9 05 - Solid Color Function?
        //00 11 0e ef b0
        
        if (cManufacturerData[5] == 0x05){      //e905 - Single Color Function 
          solid_color_function(cManufacturerData[7],cManufacturerData[8],cManufacturerData[9]);
        } else if (cManufacturerData[5] == 0x06){ // Possibly 2 color function
          e906_function(cManufacturerData[6],cManufacturerData[7],cManufacturerData[8],cManufacturerData[9],cManufacturerData[10]);
        }else if (cManufacturerData[5] == 0x08){ // Possibly 2 color function
          e908_function(cManufacturerData[6],cManufacturerData[7],cManufacturerData[10],cManufacturerData[11],cManufacturerData[12]);
        } else if (cManufacturerData[5] == 0x09){ // 5 color function
          e909_function(cManufacturerData[7],cManufacturerData[8],cManufacturerData[9],cManufacturerData[10],cManufacturerData[11],cManufacturerData[12],cManufacturerData[13]);
        } else if (cManufacturerData[5] == 0x0b){ // Circle Animation?

        } else if (cManufacturerData[5] == 0x0c){ //Cycling Colors
          e90c_function(cManufacturerData[7],cManufacturerData[8],cManufacturerData[9],cManufacturerData[10],cManufacturerData[11],cManufacturerData[12],cManufacturerData[13],cManufacturerData[14]);
        } else if (cManufacturerData[5] == 0x0e){ //NEXT ONE
          e90e_function(cManufacturerData[7],cManufacturerData[8],cManufacturerData[9],cManufacturerData[10],cManufacturerData[11],cManufacturerData[12],cManufacturerData[13],cManufacturerData[14],cManufacturerData[15],cManufacturerData[16],cManufacturerData[17],cManufacturerData[18]);
        } else if (cManufacturerData[5] == 0x0f){ //NEXT ONE
          e90f_function(cManufacturerData[7],cManufacturerData[8],cManufacturerData[9],cManufacturerData[10],cManufacturerData[11],cManufacturerData[12],cManufacturerData[13],cManufacturerData[14],cManufacturerData[15],cManufacturerData[16],cManufacturerData[17],cManufacturerData[18]);
        } else if (cManufacturerData[5] == 0x10){ //Alternating Colors
          e910_function(cManufacturerData[7],cManufacturerData[8],cManufacturerData[9],cManufacturerData[10],cManufacturerData[11],cManufacturerData[12],cManufacturerData[13],cManufacturerData[14],cManufacturerData[15],cManufacturerData[16],cManufacturerData[17],cManufacturerData[18]);
        } else if (cManufacturerData[5] == 0x11){ //Circle with Vibration?
          e911_function(cManufacturerData[7],cManufacturerData[8],cManufacturerData[9],cManufacturerData[10],cManufacturerData[11],cManufacturerData[12],cManufacturerData[13],cManufacturerData[14],cManufacturerData[15],cManufacturerData[16],cManufacturerData[17],cManufacturerData[18]);
        } else if (cManufacturerData[5] == 0x12){ //
          e912_function(cManufacturerData[7],cManufacturerData[8],cManufacturerData[9],cManufacturerData[10],cManufacturerData[11],cManufacturerData[12],cManufacturerData[13],cManufacturerData[14],cManufacturerData[15],cManufacturerData[16],cManufacturerData[17],cManufacturerData[18]);
        
        } else if (cManufacturerData[5] == 0x13){ //More Animation

        }else if (cManufacturerData[5] == 0x14){ //More Animation
          e914_function(cManufacturerData[7],cManufacturerData[8],cManufacturerData[9],cManufacturerData[10],cManufacturerData[11],cManufacturerData[12],cManufacturerData[13],cManufacturerData[14],cManufacturerData[15],cManufacturerData[16],cManufacturerData[17],cManufacturerData[18]);
        
