jjdb210/Diz_BLE/ESP32_C3_BLE_Dress100/ESP32_C3_BLE_Dress100.h
        }
      } 
    }

    return;
  }
};

int color1 =0;
int color2 =0;


void setup() {
  delay(1000);  // prevents usb driver crash on startup, do not omit this
  Serial.begin(9600);
  strip.begin();
  strip.setBrightness(40);
  for (int i = 0; i < N_LEDS; i++) {
    if (i % 2 == 1){
      strip.setPixelColor(i, strip.Color(0, 0, 255));
    } else {
      strip.setPixelColor(i, strip.Color(255, 0, 0));         
    }
  }
  strip.show();
  delay(2000);
  mode = 0;
  selected_color = 9;


  //vNopDelayMS(1000); // prevents usb         ,bm,./driver crash on startup, do not omit this


/** *Optional* Sets the filtering mode used by the scanner in the BLE controller.
 *
 *  Can be one of:
 *  CONFIG_BTDM_SCAN_DUPL_TYPE_DEVICE (0) (default)
 *  Filter by device address only, advertisements from the same address will be reported only once.
 *
 *  CONFIG_BTDM_SCAN_DUPL_TYPE_DATA (1)
 *  Filter by data only, advertisements with the same data will only be reported once,
 *  even from different addresses.
 *
 *  CONFIG_BTDM_SCAN_DUPL_TYPE_DATA_DEVICE (2)
 *  Filter by address and data, advertisements from the same address will be reported only once,
 *  except if the data in the advertisement has changed, then it will be reported again.
 *
 *  Can only be used BEFORE calling NimBLEDevice::init.
*/
  NimBLEDevice::setScanFilterMode(CONFIG_BTDM_SCAN_DUPL_TYPE_DATA);
/** *Optional* Sets the scan filter cache size in the BLE controller.
 *  When the number of duplicate advertisements seen by the controller
 *  reaches this value it will clear the cache and start reporting previously
 *  seen devices. The larger this number, the longer time between repeated
 *  device reports. Range 10 - 1000. (default 20)
 *
 *  Can only be used BEFORE calling NimBLEDevice::init.
 */
  NimBLEDevice::setScanDuplicateCacheSize(10);
  NimBLEDevice::init("");
  pBLEScan = BLEDevice::getScan();  //create new scan
  pBLEScan->setAdvertisedDeviceCallbacks(new MyAdvertisedDeviceCallbacks()); //Whats The True do here Justin?
  pBLEScan->setActiveScan(false);           // Active scan requires response from target. DO NOT USE for dresses.
  pBLEScan->setInterval(100);                // How often the scan occurs / switches channels; in milliseconds,
  pBLEScan->setWindow(99);                  // How long to scan during the interval; in milliseconds.
  pBLEScan->setMaxResults(0);               // do not store the scan results, use callback only.  

}

long mytime;
long mytime2;

void loop() {
  timer++;
  //mytime = rtc.getEpoch();
  //Simple check to make sure scanner never stops.
  if (timer % 100 == 0) {  
    if(pBLEScan->isScanning() == false) {
      Serial.printf("New Scan Started \n");      
      pBLEScan->start(0, nullptr, true);
    }
  }
  if (timer == 19999){
    timer = 0;
  }
  if (blackout){
      strip.setBrightness(0);
      for (int i = 0; i < N_LEDS; i++) {
        strip.setPixelColor(i, strip.Color(0, 0, 0));
      }
      strip.show();
  } else if (mode == 0) {                                          //Solid Color Command
      //strip.setBrightness(50);
      
      
      if (selected_color == 10){
        if (mode != lastmode || selected_color != last_color) {
          temp_color_array[0] = pallet_array[21];
          temp_color_array[1] = pallet_array[2];
          temp_color_array[2] = pallet_array[0];
          temp_color_array[3] = pallet_array[17];
          temp_color_array[4] = pallet_array[25];

          temp_start = 0;
        }
        if (timer % 200 == 0) {
          temp_start++;
          if (temp_start > 4) temp_start = 0;
          
        }
        for (int j = 0; j < 5; j++) {
          for (int i = j * (N_LEDS / 5); i < (j * (N_LEDS / 5)) + (N_LEDS / 5); i++) {
            strip.setPixelColor(i, temp_color_array[(j + temp_start) % 5]);
          }
        }

        strip.show();

       } else if (selected_color == 11){
        //Christmas 1
        if (mytime != mytime2){
           if (mytime % 3 == 0){
             for (int i = 1; i < N_LEDS; i++){
               if (i % 3 == 0){
               strip.setPixelColor(i, strip.Color(255,0,0));
               } else if (i % 3 == 1){
               strip.setPixelColor(i, strip.Color(0,255,0));
               } else {
                 strip.setPixelColor(i, strip.Color(255,255,255));
               }
             }
           } if (mytime % 3 == 1){
               for (int i = 1; i < N_LEDS; i++){
               if (i % 3 == 1){
               strip.setPixelColor(i, strip.Color(255,0,0));
               } else if (i % 3 == 2){
               strip.setPixelColor(i, strip.Color(0,255,0));
               } else {
                 strip.setPixelColor(i, strip.Color(255,255,255));
               }
             }           
             
             
             
          } else {
             for (int i = 1; i < N_LEDS; i++){
               if (i % 3 == 2){
               strip.setPixelColor(i, strip.Color(255,0,0));
               } else if (i % 3 == 0){
               strip.setPixelColor(i, strip.Color(0,255,0));
               } else {
                 strip.setPixelColor(i, strip.Color(255,255,255));
               }
             }
           }
        }
        strip.show();

      }else if (selected_color == 12){
               //Christmas 1
        for (int i = 1; i < 18; i++){
          strip.setPixelColor(i, strip.Color(0,0,0));
        }
        if (mytime != mytime2){
           if (mytime % 2 == 0){
             for (int i = 18; i < 34; i++){
               strip.setPixelColor(i, strip.Color(255,0,0));
             }
             for (int i = 34; i < 60; i++){
               strip.setPixelColor(i, strip.Color(0,255,0));
             }
           } else {
             for (int i = 18; i < 34; i++){
               strip.setPixelColor(i, strip.Color(0,255,0));
             }
             for (int i = 34; i < 60; i++){
               strip.setPixelColor(i, strip.Color(255,0,0));
             }
           }
        }
        strip.show();
        

