jjdb210/Diz_BLE/ESP32_C3_BLE_Dress100/ESP32_C3_BLE_Dress100.h
      }else if (selected_color == 13){
                //Christmas 1
        if (mytime != mytime2){
           if (mytime % 2 == 0){
             for (int i = 0; i < N_LEDS; i++){
               if (i % 2 == 0){
                 strip.setPixelColor(i, strip.Color(255,255,255));
               } else {
                 strip.setPixelColor(i, strip.Color(0,255,0));                 
               }
             }
           } else {
             for (int i = 0; i < N_LEDS; i++){
               if (i % 2 == 0){
                 strip.setPixelColor(i, strip.Color(0,255,0));
               } else {
                 strip.setPixelColor(i, strip.Color(255,255,255));                 
               }
             }
           }
        }
        strip.show();
        

      }else if (selected_color == 14){
        //Christmas 1
                        //Christmas 1
        if (mytime != mytime2){
           if (mytime % 2 == 0){
             for (int i = 0; i < N_LEDS; i++){
               if (i % 2 == 0){
                 strip.setPixelColor(i, strip.Color(255,255,255));
               } else {
                 strip.setPixelColor(i, strip.Color(255,0,0));                 
               }
             }
           } else {
             for (int i = 0; i < N_LEDS; i++){
               if (i % 2 == 0){
                 strip.setPixelColor(i, strip.Color(255,0,0));
               } else {
                 strip.setPixelColor(i, strip.Color(255,255,255));                 
               }
             }
           }
        }
        strip.show();

      }else if (selected_color == 15){
                       //Christmas 1
        if (mytime != mytime2){
           if (mytime % 2 == 0){
             for (int i = 0; i < N_LEDS; i++){
               if (i % 2 == 0){
                 strip.setPixelColor(i, strip.Color(255,0,0));
               } else {
                 strip.setPixelColor(i, strip.Color(0,255,0));                 
               }
             }
           } else {
             for (int i = 0; i < N_LEDS; i++){
               if (i % 2 == 0){
                 strip.setPixelColor(i, strip.Color(0,255,0));
               } else {
                 strip.setPixelColor(i, strip.Color(255,0,0));                 
               }
             }
           }
        }
        strip.show();
        

      }else if (selected_color == 16){
        //Christmas 1
        if (mytime != mytime2){
        for (int i = 0; i < N_LEDS; i++){
          strip.setPixelColor(i, strip.Color(0,0,120));
        }
        strip.setPixelColor(random(1,N_LEDS), strip.Color(255,255,255));
        strip.setPixelColor(random(1,N_LEDS), strip.Color(255,255,255));

        strip.setPixelColor(random(1,N_LEDS), strip.Color(255,255,255));
        strip.show();
        }
      } else if (selected_color == 17){
        //Christmas 1
        

      }else if (selected_color == 19){
        //Christmas 1
        

      } else if (selected_color == 20){
        //Christmas 1
        

      }  else if (selected_color == 18){
        //Christmas 1
        

      }  else if (selected_color == 8){
        if (timer % 1000 == 0){
              temp_x++;
              if (temp_x > N_LEDS * 3){
                temp_x = 0;
                temp_y = random(0,28); 
              }       
              
              strip.setPixelColor(temp_x, pallet_array[temp_y]);
              strip.show();  
              delay(50);          
          }
      } else if (selected_color == 7){
        if (timer % 19000 == 0){
          if (last_sequence != sequenceNumber){
             color1 = random(0,28);
             color2 = random(0,28);

            last_sequence = sequenceNumber;
     

          }  
          temp_x++;
          if (temp_x > N_LEDS){ //keep it from getting big.
            temp_x = 0;
          }
          if (temp_x % 2 == 0){
            for (int i = 0; i < N_LEDS; i++) {
              if (i % 2 == 0){
                strip.setPixelColor(i, pallet_array[color1]);
              } else {
                strip.setPixelColor(i, pallet_array[color2]);
              }
            }
          } else {
            for (int i = 0; i < N_LEDS; i++) {
              if (i % 2 == 0){
                strip.setPixelColor(i, pallet_array[color2]);
              } else {
                strip.setPixelColor(i, pallet_array[color1]);
              }
            }
          }
            strip.show();
         delay(500);
        }
      
     
        
       } else if (selected_color == 9){
          temp_color_array[0] = pallet_array[21];
          temp_color_array[1] = pallet_array[2];
          temp_color_array[2] = pallet_array[0];
          temp_color_array[3] = pallet_array[17];
          temp_color_array[4] = pallet_array[25];
        
        if (timer % 100000 == 0){
            temp_x++;
            if (temp_x > 30){
              temp_x = 0;
              temp_y++;
              if (temp_y > 4){              
                temp_y = 0;
              }
              temp_z = temp_y + 1;
              if (temp_z > 4){
                temp_z = 0;
              }       
            }       

            int red1 = temp_color_array[temp_y] >> 16 & 0xff;
            int green1 = temp_color_array[temp_y] >> 8 & 0xff;
            int blue1 = temp_color_array[temp_y] >> 0 & 0xff;
            int red2 = temp_color_array[temp_z] >> 16 & 0xff;
            int green2 = temp_color_array[temp_z] >> 8 & 0xff;
            int blue2 = temp_color_array[temp_z] >> 0 & 0xff;

            int red_step = (red2 - red1) / 30;
            int green_step = (green2 - green1) / 30;
            int blue_step = (blue2 - blue1) / 30;

            uint32_t current_color = strip.Color(red1 + (temp_x * red_step), green1 + (temp_x * green_step), blue1 + (temp_x * blue_step));
            for (int i = 0; i < N_LEDS; i++){
              strip.setPixelColor(i, current_color);
            }
            strip.show();            
      } 
       
      


    } else {
        for (int i = 0; i < N_LEDS; i++) {
          strip.setPixelColor(i, mode_array[selected_color]);
        }
        strip.show();
        delay(50);  
      }
  
    lastmode = mode;
    last_color = selected_color;
  }
   mytime2 = mytime;
}